Raw-wrk-files/run-3/json/php/raw
Welcome to Ubuntu 12.04.3 LTS (GNU/Linux 3.9.0-030900-generic x86_64)

 * Documentation:  https://help.ubuntu.com/

  System information as of Mon Oct 21 15:08:59 PDT 2013

  System load:  0.03               Processes:           119
  Usage of /:   5.8% of 129.62GB   Users logged in:     0
  Memory usage: 3%                 IP address for eth1: 172.16.98.98
  Swap usage:   0%

  Graph this data and manage this system at https://landscape.canonical.com/

64 packages can be updated.
24 updates are security updates.


---------------------------------------------------------
 Running Primer php
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 5 -c 8 -t 8 http://tfbapp:8080/json.php
---------------------------------------------------------

Running 5s test @ http://tfbapp:8080/json.php
  8 threads and 8 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   294.16us   58.92us 689.00us   68.04%
    Req/Sec     3.52k   252.48     4.33k    62.78%
  132504 requests in 5.00s, 28.43MB read
Requests/sec:  26500.85
Transfer/sec:      5.69MB

---------------------------------------------------------
 Running Warmup php
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/json.php
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/json.php
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.49ms   12.37ms   1.06s    99.68%
    Req/Sec     7.57k   816.05    11.55k    77.29%
  868148 requests in 15.00s, 186.24MB read
Requests/sec:  57876.64
Transfer/sec:     12.42MB

---------------------------------------------------------
 Concurrency: 8 for php
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive'  -d 15 -c 8 -t 8 http://tfbapp:8080/json.php
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/json.php
  8 threads and 8 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   292.69us   58.87us 543.00us   67.52%
    Req/Sec     3.53k   235.85     4.78k    68.13%
  401641 requests in 15.00s, 86.16MB read
Requests/sec:  26776.30
Transfer/sec:      5.74MB

---------------------------------------------------------
 Concurrency: 16 for php
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive'  -d 15 -c 16 -t 8 http://tfbapp:8080/json.php
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/json.php
  8 threads and 16 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   310.07us   79.76us   0.99ms   71.38%
    Req/Sec     6.69k   431.66     8.22k    68.47%
  760811 requests in 15.00s, 163.22MB read
Requests/sec:  50721.33
Transfer/sec:     10.88MB

---------------------------------------------------------
 Concurrency: 32 for php
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive'  -d 15 -c 32 -t 8 http://tfbapp:8080/json.php
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/json.php
  8 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   495.03us  182.67us   8.09ms   74.65%
    Req/Sec     8.51k   747.52    11.89k    70.00%
  961207 requests in 15.00s, 206.21MB read
Requests/sec:  64081.01
Transfer/sec:     13.75MB

---------------------------------------------------------
 Concurrency: 64 for php
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive'  -d 15 -c 64 -t 8 http://tfbapp:8080/json.php
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/json.php
  8 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.94ms  455.40us   9.53ms   77.13%
    Req/Sec     9.02k     1.01k   13.22k    68.89%
  1023102 requests in 15.00s, 219.49MB read
Requests/sec:  68206.47
Transfer/sec:     14.63MB

---------------------------------------------------------
 Concurrency: 128 for php
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive'  -d 15 -c 128 -t 8 http://tfbapp:8080/json.php
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/json.php
  8 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.07ms    0.98ms  17.22ms   79.59%
    Req/Sec     8.18k   805.75    15.89k    72.91%
  920219 requests in 15.00s, 197.41MB read
Requests/sec:  61348.29
Transfer/sec:     13.16MB

---------------------------------------------------------
 Concurrency: 256 for php
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive'  -d 15 -c 256 -t 8 http://tfbapp:8080/json.php
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/json.php
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.42ms    3.53ms 441.96ms   92.31%
    Req/Sec     7.67k   830.33    13.89k    72.40%
  863952 requests in 15.00s, 185.34MB read
Requests/sec:  57597.18
Transfer/sec:     12.36MB